IOIOI/nRF51/project/ble_peripheral/ble_app_uart/main.cpp
/**@brief Function for handling the Device Manager events.
 *
 * @param[in] p_evt  Data associated to the device manager event.
 */
static uint32_t device_manager_evt_handler(dm_handle_t const * p_handle,
                                           dm_event_t const  * p_event,
                                           ret_code_t        event_result)
{
	 uint32_t err_code;

	    static bool device_delete_all_started;

	    // Recovery in the event of DM_DEVICE_CONTEXT_FULL
	    if(event_result == DM_DEVICE_CONTEXT_FULL)
	    {
	        /* Clear all devices from the bond table*/
	        err_code = dm_device_delete_all(&m_app_handle);
	        APP_ERROR_CHECK(err_code);

	        device_delete_all_started = true;

	    }
	    else
	    {
	        APP_ERROR_CHECK(event_result);
	    }

	    if (p_event->event_id == DM_EVT_DEVICE_CONTEXT_STORED)
	    {
	        table_index_t table_index;

	        //Find first and last bond created from m_bond_index_table
	        app_bond_find(&m_app_bond_table,&table_index);

			//Increment counter if a new bond was created
	        if(!(table_index.mr_cnt_val >= m_app_bond_table.app_bond_cnt[p_handle->device_id]))
	        {
	           table_index.mr_cnt_val++;
	           m_app_bond_table.app_bond_cnt[p_handle->device_id] = table_index.mr_cnt_val;
	        }

	        //Delete first created bond if bond table is full
	        if(((table_index.mr_cnt_val-table_index.lr_cnt_val)== DEVICE_MANAGER_MAX_BONDS-1)
	             && (table_index.lr_cnt_val != NO_APP_CONTEXT))
	          {
	                uint32_t err_code;
	                dm_handle_t device;

	                device.appl_id = 0;

	                m_app_bond_table.app_bond_cnt[table_index.lr_index]=NO_APP_CONTEXT;
	                device.device_id = m_app_bond_table.device_id[table_index.lr_index];

	                err_code = dm_device_delete(&device);
	                APP_ERROR_CHECK(err_code);

	          }

	        //Update the app context for new device
	        app_bond_update_context(&m_app_bond_table,p_handle);

	    }
	    else if (p_event->event_id ==DM_EVT_DEVICE_CONTEXT_DELETED)
	    {

	         /* Wait for all devices to be cleared before perfoming a sys reset */
	         if(device_delete_all_started && (p_handle->device_id == DEVICE_MANAGER_MAX_BONDS -1))
	         {
	             err_code = sd_nvic_SystemReset();
	             APP_ERROR_CHECK(err_code);
	         }

	    }


	    return NRF_SUCCESS;
}

/**@brief Function for the Device Manager initialization.
 *
 * @param[in] erase_bonds  Indicates whether bonding information should be cleared from
 *                         persistent storage during initialization of the Device Manager.
 */
static void device_manager_init(bool erase_bonds)
{
    uint32_t               err_code;
    dm_init_param_t        init_param = {erase_bonds};
    dm_application_param_t register_param;

    // Initialize persistent storage module.
    err_code = pstorage_init();
    APP_ERROR_CHECK(err_code);

    err_code = dm_init(&init_param);
    APP_ERROR_CHECK(err_code);

    memset(&register_param.sec_param, 0, sizeof(ble_gap_sec_params_t));

    register_param.sec_param.bond         = SEC_PARAM_BOND;
    register_param.sec_param.mitm         = SEC_PARAM_MITM;
    register_param.sec_param.io_caps      = SEC_PARAM_IO_CAPABILITIES;
    register_param.sec_param.oob          = SEC_PARAM_OOB;
    register_param.sec_param.min_key_size = SEC_PARAM_MIN_KEY_SIZE;
    register_param.sec_param.max_key_size = SEC_PARAM_MAX_KEY_SIZE;
    register_param.evt_handler            = device_manager_evt_handler;
    register_param.service_type           = DM_PROTOCOL_CNTXT_GATT_SRVR_ID;

    err_code = dm_register(&m_app_handle, &register_param);
    APP_ERROR_CHECK(err_code);

    app_bond_init(&m_app_bond_table);

        for(uint8_t i = 0; i < DEVICE_MANAGER_MAX_BONDS; i++)
        {
            printf("[APP][ID: %d], Application context : %08X\r\n",m_app_bond_table.device_id[i],(unsigned int) m_app_bond_table.app_bond_cnt[i]);
        }
}


/**@brief   Function for handling app_uart events.
 *
 * @details This function will receive a single character from the app_uart module and append it to 
 *          a string. The string will be be sent over BLE when the last character received was a 
 *          'new line' i.e '\n' (hex 0x0D) or if the string has reached a length of 
 *          @ref NUS_MAX_DATA_LENGTH.
 */
/**@snippet [Handling the data received over UART] */
void uart_event_handle(app_uart_evt_t * p_event)
{
    static uint8_t data_array[BLE_NUS_MAX_DATA_LEN];
    static uint8_t index = 0;
    uint32_t       err_code;

    switch (p_event->evt_type)
    {
        case APP_UART_DATA_READY:
            UNUSED_VARIABLE(app_uart_get(&data_array[index]));
            index++;

            if ((data_array[index - 1] == '\n') || (index >= (BLE_NUS_MAX_DATA_LEN)))
            {
                err_code = ble_nus_string_send(&m_nus, data_array, index);
                if (err_code != NRF_ERROR_INVALID_STATE)
                {
                    APP_ERROR_CHECK(err_code);
                }
                
                index = 0;
            }
            break;

        case APP_UART_COMMUNICATION_ERROR:
            APP_ERROR_HANDLER(p_event->data.error_communication);
            break;

        case APP_UART_FIFO_ERROR:
            APP_ERROR_HANDLER(p_event->data.error_code);
            break;

        default:
            break;
    }
}
/**@snippet [Handling the data received over UART] */


/**@brief  Function for initializing the UART module.
 */
/**@snippet [UART Initialization] */
static void uart_init(void)
{
    uint32_t                     err_code;
    const app_uart_comm_params_t comm_params =
    {
        RX_PIN_NUMBER,
        TX_PIN_NUMBER,
        RTS_PIN_NUMBER,
        CTS_PIN_NUMBER,
        APP_UART_FLOW_CONTROL_DISABLED,
        false,
        UART_BAUDRATE_BAUDRATE_Baud38400
    };

    APP_UART_FIFO_INIT( &comm_params,
                       UART_RX_BUF_SIZE,
                       UART_TX_BUF_SIZE,
                       uart_event_handle,
                       APP_IRQ_PRIORITY_LOW,
                       err_code);
    APP_ERROR_CHECK(err_code);
}
/**@snippet [UART Initialization] */


/**@brief Function for initializing the Advertising functionality.
 */
static void advertising_init(void)
{
    uint32_t      err_code;
    ble_advdata_t advdata;
    ble_advdata_t scanrsp;

